import pandas as pd


data = {
    'Имя': ['Иван', 'Мария', 'Павел', 'Анна', 'Дмитрий', 'Ольга', 'Сергей', 'Елена', 'Михаил', 'Наталья'],
    'Математика': [5, 4, 3, 5, 2, 4, 3, 5, 4, 3],
    'Русский язык': [4, 5, 3, 4, 2, 5, 3, 4, 5, 2],
    'История': [3, 4, 4, 5, 3, 4, 2, 3, 4, 5],
    'Физика': [4, 3, 4, 4, 2, 3, 4, 5, 3, 4],
    'Биология': [5, 4, 3, 4, 2, 5, 3, 4, 5, 3]
}
df = pd.DataFrame(data)


sr_marks = df.drop(columns='Имя').mean()
print("Средние оценки по предметам:")
print(sr_marks)


md_marks = df.drop(columns='Имя').median()
print("\nМедианные оценки по предметам:")
print(md_marks)


Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)

IQR_math = Q3_math - Q1_math

print('Стандартное отклонение:')
print(df.drop(columns='Имя').std())